import React from 'react';

class FlowControl extends React.Component {
    render() {
        return (
            <div className="FlowControl">
                <h1>Поточний контроль</h1>
                <table>
                    <thead>
                        <tr>
                            <th>Дисципліна</th>
                            <th>Викладач</th>
                            <th>Оцінка</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td>Сенсорні мережі</td>
                            <td>Лісовський К. С.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Передача голосу та відео ІР мережею (VоІР, ІРТV)</td>
                            <td>Астраханцев А. А.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Економіка і організація виробництва</td>
                            <td>Шостак І. В.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Охорона праці та цивільний захист</td>
                            <td>Землянська О. В.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Іноземна мова професійного спрямування-2. Практичний курс іноземної мови для професійного спілкування ІІ</td>
                            <td>Голуб Т. П.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Технології розробки web-орієнтованих систем</td>
                            <td>Суліма С. В.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Програмування мікрокомп’ютерних систем обміну даних-1</td>
                            <td>Могильний С. Б.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Планування та оптимізація мереж рухомого зв’язку</td>
                            <td>Босий Б. І.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Курсова робота з програмування мікрокомп’ютерних систем обміну даних</td>
                            <td>Могильний С. Б.</td>
                            <td></td>
                        </tr>
                        <tr>
                            <td>Дослідження операцій</td>
                            <td>Скулиш М. А.</td>
                            <td></td>
                        </tr>
                    </tbody>
                </table>
            </div>
        );
    }
}

export default FlowControl;